---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColorFillSwatchWidthParam
source: html/57bb85cf-2801-9b88-51b9-ecf71e138c7f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColorFillSwatchWidthParam Property

"Swatch Width"

## Syntax (C#)
```csharp
public static ForgeTypeId ColorFillSwatchWidthParam { get; }
```